hankso/esp32/espbase/main/drivers.c
/******************************************************************************
 * PWM by LEDC
 */

#define SPEED_MODE  LEDC_LOW_SPEED_MODE

#define TMR_SERVO   LEDC_TIMER_1
#define RES_SERVO   LEDC_TIMER_10_BIT
#define CH_SERVOH   LEDC_CHANNEL_1
#define CH_SERVOV   LEDC_CHANNEL_2

#define TMR_BUZZER  LEDC_TIMER_2
#define RES_BUZZER  LEDC_TIMER_10_BIT
#define CH_BUZZER   LEDC_CHANNEL_3

static void pwm_initialize() {
#ifdef CONFIG_BASE_USE_SERVO
    const ledc_timer_config_t servo_conf = {
        .speed_mode         = SPEED_MODE,
        .timer_num          = TMR_SERVO,
        .duty_resolution    = RES_SERVO,
        .freq_hz            = 50, // 20ms
        .clk_cfg            = LEDC_AUTO_CLK
    };
    ESP_ERROR_CHECK( ledc_timer_config(&servo_conf) );
    const ledc_channel_config_t channel0_conf = {
        .gpio_num           = PIN_SVOH,
        .speed_mode         = SPEED_MODE,
        .channel            = CH_SERVOH,
        .timer_sel          = TMR_SERVO,
        .hpoint             = 0,
        .duty               = 0
    };
    const ledc_channel_config_t channel1_conf = {
        .gpio_num           = PIN_SVOV,
        .speed_mode         = SPEED_MODE,
        .channel            = CH_SERVOV,
        .timer_sel          = TMR_SERVO,
        .hpoint             = 0,
        .duty               = 0
    };
    ESP_ERROR_CHECK( ledc_channel_config(&channel0_conf) );
    ESP_ERROR_CHECK( ledc_channel_config(&channel1_conf) );
#endif
#ifdef CONFIG_BASE_USE_BUZZER
    const ledc_timer_config_t buzzer_conf = {
        .speed_mode         = SPEED_MODE,
        .timer_num          = TMR_BUZZER,
        .duty_resolution    = RES_BUZZER,
        .freq_hz            = 5000, // 0-5kHz is commonlly used
        .clk_cfg            = LEDC_AUTO_CLK
    };
    ESP_ERROR_CHECK( ledc_timer_config(&buzzer_conf) );
    const ledc_channel_config_t channel2_conf = {
        .gpio_num           = PIN_BUZZ,
        .speed_mode         = SPEED_MODE,
        .channel            = CH_BUZZER,
        .timer_sel          = TMR_BUZZER,
        .hpoint             = 0,
        .duty               = 0
    };
    ESP_ERROR_CHECK( ledc_channel_config(&channel2_conf) );
#endif
}

static esp_err_t pwm_set_duty(int channel, int duty) {
    esp_err_t err = ledc_set_duty(SPEED_MODE, channel, duty);
    if (!err) err = ledc_update_duty(SPEED_MODE, channel);
    return err;
}

#ifdef CONFIG_BASE_USE_SERVO
// mapping 0-180 deg to 0.5-2.5 ms
static const float servo_offset = 0.5 / 20 * ((1 << RES_SERVO) - 1);
static const float servo_scale  = 2.0 / 20 * ((1 << RES_SERVO) - 1) / 180;

esp_err_t pwm_set_degree(int hdeg, int vdeg) {
    esp_err_t err = ESP_OK;
    if (!err && hdeg >= 0) {
        hdeg = MIN(180, 166 * hdeg / 180 + 14);
        err = pwm_set_duty(CH_SERVOH, hdeg * servo_scale + servo_offset);
    }
    if (!err && vdeg >= 0) {
        vdeg = MIN(160, vdeg);
        err = pwm_set_duty(CH_SERVOV, vdeg * servo_scale + servo_offset);
    }
    return err;
}

esp_err_t pwm_get_degree(int *hdeg, int *vdeg) {
    int hduty = ledc_get_duty(SPEED_MODE, CH_SERVOH),
        vduty = ledc_get_duty(SPEED_MODE, CH_SERVOV);
    *hdeg = (int)((hduty - servo_offset) / servo_scale);
    *vdeg = (int)((vduty - servo_offset) / servo_scale);
    return ESP_OK;
}
#else
esp_err_t pwm_set_degree(int h, int v) {
    return ESP_ERR_NOT_SUPPORTED; NOTUSED(h); NOTUSED(v);
}
esp_err_t pwm_get_degree(int *h, int *v) {
    return ESP_ERR_NOT_SUPPORTED; NOTUSED(h); NOTUSED(v);
}
#endif

#ifdef CONFIG_BASE_USE_BUZZER
// mapping 0-100 percent to 0%-50% of duty
static const float buzzer_scale = ((1 << RES_BUZZER) - 1) / 200;

esp_err_t pwm_set_tone(int freq, int pcnt) {
    esp_err_t err = freq > 20000 ? ESP_ERR_INVALID_ARG : ESP_OK;
    if (freq == 0) pcnt = 0;
    if (!err && freq > 0)  err = ledc_set_freq(SPEED_MODE, TMR_BUZZER, freq);
    if (!err && pcnt >= 0) err = pwm_set_duty(CH_BUZZER, pcnt * buzzer_scale);
    return err;
}

esp_err_t pwm_get_tone(int *freq, int *pcnt) {
    *freq = ledc_get_freq(SPEED_MODE, TMR_BUZZER);
    *pcnt = (int)(ledc_get_duty(SPEED_MODE, CH_SERVOH) / buzzer_scale);
    return ESP_OK;
}
#else
esp_err_t pwm_set_tone(int f, int p) {
    return ESP_ERR_NOT_SUPPORTED; NOTUSED(f); NOTUSED(p);
}
esp_err_t pwm_get_tone(int *f, int *p) {
    return ESP_ERR_NOT_SUPPORTED; NOTUSED(f); NOTUSED(p);
}
#endif

/******************************************************************************
 * SPI Master interface
 */

#ifdef CONFIG_BASE_USE_SPI
static void spi_initialize() {
    const spi_bus_config_t buf_conf = {
        .mosi_io_num = PIN_MOSI,
        .miso_io_num = PIN_MISO,
        .sclk_io_num = PIN_SCLK,
        .max_transfer_sz = 81920,
        .flags = SPICOMMON_BUSFLAG_MASTER,
        .intr_flags = 0
    };
    esp_err_t err = spi_bus_initialize(NUM_SPI, &buf_conf, SPI_DMA_CH_AUTO);
    if (err && err != ESP_ERR_INVALID_STATE)
        ESP_LOGE(TAG, "SPI init failed: %s", esp_err_to_name(err));
}
#endif

/******************************************************************************
 * I2C Master interface
 */

#ifdef CONFIG_BASE_USE_I2C
static void i2c_initialize() {
    const i2c_config_t i2c_conf = {
        .mode               = I2C_MODE_MASTER,
        .sda_io_num         = PIN_SDA,
        .sda_pullup_en      = GPIO_PULLUP_ENABLE,
        .scl_io_num         = PIN_SCL,
        .scl_pullup_en      = GPIO_PULLUP_ENABLE,
        .master.clk_speed   = CONFIG_BASE_I2C_SPEED,
    };
    ESP_ERROR_CHECK( i2c_param_config(NUM_I2C, &i2c_conf) );
    ESP_ERROR_CHECK( i2c_driver_install(NUM_I2C, i2c_conf.mode, 0, 0, 0) );
    
}

esp_err_t smbus_probe(int bus, uint8_t addr) {
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (addr << 1) | I2C_MASTER_WRITE, true);
    i2c_master_stop(cmd);
    esp_err_t err = i2c_master_cmd_begin(bus, cmd, TIMEOUT(20));
    i2c_cmd_link_delete(cmd);
    return err;
}

esp_err_t smbus_wregs(
    int bus, uint8_t addr, uint8_t reg, uint8_t *val, size_t len
) {
    // SMBus Write protocol:
    //      S | (ADDR | W) | ACK | REG | ACK | (DATA | ACK) * n | P
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, addr << 1 | I2C_MASTER_WRITE, true);
    i2c_master_write_byte(cmd, reg, true);
    i2c_master_write(cmd, val, len, true);
    i2c_master_stop(cmd);
    esp_err_t err = i2c_master_cmd_begin(bus, cmd, TIMEOUT(20 * len));
    i2c_cmd_link_delete(cmd);
    return err;
}

