hankso/esp32/espbase/main/drivers.c
esp_err_t smbus_rregs(
    int bus, uint8_t addr, uint8_t reg, uint8_t *val, size_t len
) {
    // SMBus Read protocol:
    //      S | (ADDR | W) | ACK | REG | ACK |
    //      S | (ADDR | R) | ACK | (DATA | A) * n - 1 | (DATA | N) | P
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, addr << 1 | I2C_MASTER_WRITE, true);
    i2c_master_write_byte(cmd, reg, true);
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, addr << 1 | I2C_MASTER_READ, true);
    if (len > 1) i2c_master_read(cmd, val, len - 1, I2C_MASTER_ACK);
    i2c_master_read_byte(cmd, val + len - 1, I2C_MASTER_NACK);
    i2c_master_stop(cmd);
    esp_err_t err = i2c_master_cmd_begin(bus, cmd, TIMEOUT(20 * len));
    i2c_cmd_link_delete(cmd);
    return err;
}
#else // CONFIG_BASE_USE_I2C
esp_err_t smbus_probe(int b, uint8_t a) {
    return ESP_ERR_NOT_SUPPORTED; NOTUSED(b); NOTUSED(a);
}
esp_err_t smbus_wregs(int b, uint8_t a, uint8_t r, uint8_t *v, size_t l) {
    return ESP_ERR_NOT_SUPPORTED; NOTUSED(b); NOTUSED(a);
    NOTUSED(r); NOTUSED(v); NOTUSED(l);
}
esp_err_t smbus_rregs(int b, uint8_t a, uint8_t r, uint8_t *v, size_t l) {
    return ESP_ERR_NOT_SUPPORTED; NOTUSED(b); NOTUSED(a);
    NOTUSED(r); NOTUSED(v); NOTUSED(l);
}
#endif // CONFIG_BASE_USE_I2C

esp_err_t smbus_write_byte(int bus, uint8_t addr, uint8_t reg, uint8_t val) {
    return smbus_wregs(bus, addr, reg, &val, 1);
}

esp_err_t smbus_read_byte(int bus, uint8_t addr, uint8_t reg, uint8_t *val) {
    return smbus_rregs(bus, addr, reg, val, 1);
}

esp_err_t smbus_write_word(int bus, uint8_t addr, uint8_t reg, uint16_t val) {
    uint8_t buf[2] = { val >> 8, val & 0xFF };
    return smbus_wregs(bus, addr, reg, buf, 2);
}

esp_err_t smbus_read_word(int bus, uint8_t addr, uint8_t reg, uint16_t *val) {
    uint8_t buf[2] = { 0, 0 };
    esp_err_t err = smbus_rregs(bus, addr, reg, buf, 2);
    if (!err) *val = buf[0] << 8 | buf[1];
    return err;
}

esp_err_t smbus_dump(int bus, uint8_t addr, uint8_t reg, uint8_t num) {
#define LENGTH 16
    uint8_t *buf = NULL;
    esp_err_t err = EMALLOC(buf, num);
    if (!err) err = smbus_rregs(bus, addr, reg, buf, num);
    if (!err && num) {
        printf("I2C %d-%02X register table 0x%02X - 0x%02X\n  ",
               bus, addr, reg, reg + num);
        LOOPN(i, LENGTH) { printf(" %02X", i); }
        if (reg % LENGTH) // pad start spaces
            printf("\n%02X%*s", reg - (reg % LENGTH), 3 * (reg % LENGTH), "");
        LOOPN(i, num) {
            if ((i + reg) % LENGTH == 0) printf("\n%02X", i + reg); // newline
            printf(" %02X", buf[i]);
        }
        putchar('\n');
    }
    TRYFREE(buf);
    return err;
}

esp_err_t smbus_toggle(int bus, uint8_t addr, uint8_t reg, uint8_t bit) {
    uint8_t val, mask = BIT(bit);
    esp_err_t err = smbus_read_byte(bus, addr, reg, &val);
    if (!err) return err;
    if (val & mask) {
        val &= ~mask;
    } else {
        val |= mask;
    }
    return smbus_write_byte(bus, addr, reg, val);
}

static bool i2c_master_inited(int bus) {
    esp_err_t err = smbus_probe(bus, 0);
    if (err == ESP_ERR_INVALID_ARG || err == ESP_ERR_INVALID_STATE)
        return false;
    return true;
}

void i2c_detect(int bus) {
    if (!i2c_master_inited(bus)) return;
    LOOPN(i, 0x10) {
        if (!i) printf("  ");
        printf(" %02X", i);
    }
    LOOPN(addr, 0x7F) {
        if (addr % 0x10 == 0)
            printf("\n%02X", addr);
        if (!addr) {
            printf("   ");
            continue;
        }
        switch (smbus_probe(bus, addr)) {
        case ESP_OK:            printf(" %02X", addr); break;
        case ESP_ERR_TIMEOUT:   printf(" UU"); break;
        default:                printf(" --");
        }
        fflush(stdout);
    }
}

/******************************************************************************
 * GPIO Expander
 */

#ifdef CONFIG_BASE_GPIOEXP_I2C
static const uint8_t i2c_pin_addr[3] = { 0b0100000, 0b0100001, 0b0100010 };
static uint8_t i2c_pin_data[3] = { 0, 0, 0 }, i2c_pin_probed[3];

static esp_err_t i2c_gexp_set_level(gexp_num_t pin, bool level) {
    if (!PIN_IS_I2CEXP(pin)) return ESP_ERR_INVALID_ARG;
    uint8_t num = pin - PIN_I2C_BASE, idx = num >> 3, mask = BIT(num & 0x7);
    if (!i2c_pin_probed[idx]) return ESP_ERR_NOT_FOUND;
    uint8_t addr = i2c_pin_addr[idx], *datp = i2c_pin_data + idx;
    *datp = level ? (*datp | mask) : (*datp & ~mask);
    return i2c_master_write_to_device(NUM_I2C, addr, datp, 1, 20);
}

static esp_err_t i2c_gexp_get_level(gexp_num_t pin, bool *level, bool sync) {
    if (!PIN_IS_I2CEXP(pin)) return ESP_ERR_INVALID_ARG;
    uint8_t num = pin - PIN_I2C_BASE, idx = num >> 3, mask = BIT(num & 0x7);
    if (!i2c_pin_probed[idx]) return ESP_ERR_NOT_FOUND;
    uint8_t addr = i2c_pin_addr[idx], *datp = i2c_pin_data + idx;
    esp_err_t err = ESP_OK;
    if (sync) err = i2c_master_read_from_device(NUM_I2C, addr, datp, 1, 20);
    if (!err) *level = *datp & mask;
    return err;
}
#endif

#ifdef CONFIG_BASE_GPIOEXP_SPI
static spi_device_handle_t spi_pin_hdl = NULL;
static spi_transaction_t spi_pin_trans;
static uint8_t *spi_pin_data;

static esp_err_t spi_gexp_set_level(gexp_num_t pin, bool level) {
    if (!spi_pin_hdl) return ESP_ERR_INVALID_STATE;
    if (!PIN_IS_SPIEXP(pin)) return ESP_ERR_INVALID_ARG;
    int num = pin - PIN_SPI_BASE;
    uint8_t idx = num >> 3, mask = BIT(num & 0x7), *datp = spi_pin_data + idx;
    *datp = level ? (*datp | mask) : (*datp & ~mask);
    return spi_device_polling_transmit(spi_pin_hdl, &spi_pin_trans);
}

static esp_err_t spi_gexp_get_level(gexp_num_t pin, bool *level, bool sync) {
    if (!spi_pin_hdl) return ESP_ERR_INVALID_STATE;
    if (!PIN_IS_SPIEXP(pin)) return ESP_ERR_INVALID_ARG;
    int num = pin - PIN_SPI_BASE;
    uint8_t idx = num >> 3, mask = BIT(num & 0x7), *datp = spi_pin_data + idx;
    esp_err_t err = ESP_OK;
    if (sync) err = spi_device_polling_transmit(spi_pin_hdl, &spi_pin_trans);
    if (!err) *level = *datp & mask;
    return err;
}
#endif

