hankso/esp32/espbase/main/drivers.c
#ifdef CONFIG_BASE_USE_GPIOEXP
static void gexp_initialize() {
    esp_err_t err;
#   ifdef CONFIG_BASE_GPIOEXP_I2C
    if (PIN_I2C_COUNT > (LEN(i2c_pin_data) * 8) || PIN_I2C_COUNT <= 0) {
        ESP_LOGE(TAG, "Invalid I2C GPIOExp pin count: %d", PIN_I2C_COUNT);
        return;
    }
    uint8_t found = 0;
    LOOPN(i, LEN(i2c_pin_data)) {
        err = smbus_probe(NUM_I2C, i2c_pin_addr[i]);
        if (err == ESP_ERR_INVALID_STATE) break; // driver not installed
        found += (i2c_pin_probed[i] = err == ESP_OK);
    }
    if (!found) {
        err = ESP_ERR_NOT_FOUND;
        ESP_LOGE(TAG, "I2C GPIOExp init error: %s", esp_err_to_name(err));
    }
#   endif
#   ifdef CONFIG_BASE_GPIOEXP_SPI
    // If the transmitted data is 32bits or less, it is preferred to use
    // tx_data in spi_transaction_t. Each expander chip uses 8bits.
    if (PIN_SPI_COUNT % 8 || PIN_SPI_COUNT <= 0) {
        ESP_LOGE(TAG, "Invalid SPI GPIOExp pin count: %d", PIN_SPI_COUNT);
        return;
    }
    if (PIN_SPI_COUNT <= 32) {
        spi_pin_data = spi_pin_trans.tx_data;
        spi_pin_trans.flags = SPI_TRANS_USE_TXDATA;
        spi_pin_trans.length = PIN_SPI_COUNT;
    } else if (ECALLOC(spi_pin_data, 1, PIN_SPI_COUNT / 8)) {
        ESP_LOGE(TAG, "Could not allocate memory for SPI GPIOExp");
        return;
    } else {
        spi_pin_trans.length = PIN_SPI_COUNT;
        spi_pin_trans.tx_buffer = spi_pin_data;
    }
    const spi_device_interface_config_t dev_conf = {
        .command_bits = 0,
        .address_bits = 0,
        .dummy_bits = 0,
        .mode = 0b10,                       // CPOL = 1, CPHA = 0
        .duty_cycle_pos = 128,              // 128/256 = 50% (Tlow = Thigh)
        .cs_ena_pretrans = 0,
        .cs_ena_posttrans = 0,
        .clock_speed_hz = SPI_MASTER_FREQ_8M,
        .input_delay_ns = 0,
        .spics_io_num = PIN_CS2,
        .flags = 0,
        .queue_size = 1,                    // only one transaction allowed
        .pre_cb = NULL,
        .post_cb = NULL
    };
    err = spi_bus_add_device(NUM_SPI, &dev_conf, &spi_pin_hdl);
    if (err) ESP_LOGE(TAG, "SPI GPIOExp init error: %s", esp_err_to_name(err));
#   endif
}
#endif

/******************************************************************************
 * GPIO Interrupt (inc. button & knob)
 */

static const char * const gpio_default_usage[GPIO_PIN_COUNT] = {
#if defined(TARGET_ESP32)
    [0]         = "Strapping PU",
    [2]         = "Strapping PD",
    [5]         = "Strapping PU",
    [6]         = "Flash SPICLK",
    [7]         = "Flash SPIQ",
    [8]         = "Flash SPID",
    [9]         = "Flash SPIHD",
    [10]        = "Flash SPIWP",
    [11]        = "Flash SPICS0",
    [16]        = "Flash D2WD",
    [17]        = "Flash D2WD",
    [20]        = "ESP32-PICO-V3",
#elif defined(TARGET_ESP32S3)
    [0]         = "Strapping PU",
    [3]         = "Strapping Float",
    [19]        = "USB DN",
    [20]        = "USB DP",
    [26]        = "Flash SPICS1",
    [27]        = "Flash SPIHD",
    [28]        = "Flash SPIWP",
    [29]        = "Flash SPICS0",
    [30]        = "Flash SPICLK",
    [31]        = "Flash SPIQ",
    [32]        = "Flash SPID",
    [45]        = "Strapping PD",
    [46]        = "Strapping PD",
#endif
#ifdef CONFIG_BASE_USE_LED
    [PIN_LED]   = "LED",
#endif
#ifdef CONFIG_BASE_USE_UART
    [PIN_TXD]   = "UART" STR(CONFIG_BASE_UART_NUM) " TXD",
    [PIN_RXD]   = "UART" STR(CONFIG_BASE_UART_NUM) " RXD",
#endif
#ifdef CONFIG_BASE_USE_I2C0
    [PIN_SDA0]  = "I2C0 SDA",
    [PIN_SCL0]  = "I2C0 SCL",
#endif
#ifdef CONFIG_BASE_USE_I2C1
    [PIN_SDA1]  = "I2C1 SDA",
    [PIN_SCL1]  = "I2C1 SCL",
#endif
#ifdef CONFIG_BASE_USE_SPI
    [PIN_MISO]  = "SPI MISO",
    [PIN_MOSI]  = "SPI MOSI",
    [PIN_SCLK]  = "SPI SCLK",
#endif
#ifdef PIN_CS0
    [PIN_CS0]   = "SPI CS0 (SDCard)",
#endif
#ifdef PIN_CS1
    [PIN_CS1]   = "SPI CS1 (Screen)",
#endif
#ifdef PIN_CS2
    [PIN_CS2]   = "SPI CS2 (GPIOExp)",
#endif
#ifdef CONFIG_BASE_SCREEN_SPI
    [PIN_SDC]   = "SPI Screen D/C",
#endif
#ifdef CONFIG_BASE_GPIO_SCN_RST
    [PIN_SRST]  = "SPI Screen RESET",
#endif
#ifdef CONFIG_BASE_USE_INT
    [PIN_INT]   = "Interrupt",
#endif
#if defined(CONFIG_BASE_ADC_HALL_SENSOR)
    [PIN_ADC1]  = "HALL Sensor P",
    [PIN_ADC2]  = "HALL Sensor N",
#elif defined(CONFIG_BASE_ADC_JOYSTICK)
    [PIN_ADC1]  = "Joystick X",
    [PIN_ADC2]  = "Joystick Y",
#else
#   ifdef PIN_ADC1
    [PIN_ADC1]  = "ADC1",
#   endif
#   ifdef PIN_ADC2
    [PIN_ADC2]  = "ADC2",
#   endif
#endif
#ifdef CONFIG_BASE_USE_DAC
    [PIN_DAC]   = "DAC",
#endif
#ifdef CONFIG_BASE_USE_TPAD
    [PIN_TPAD]  = "Touch",
#endif
#ifdef CONFIG_BASE_USE_BTN
    [PIN_BTN]   = "Button",
#endif
#ifdef CONFIG_BASE_USE_KNOB
    [PIN_ENCA]  = "Knob encoder A",
    [PIN_ENCB]  = "Knob encoder B",
#endif
#ifdef CONFIG_BASE_USE_SERVO
    [PIN_SVOH]  = "Servo Yaw",
    [PIN_SVOV]  = "Servo Pitch",
#endif
#ifdef CONFIG_BASE_USE_BUZZER
    [PIN_BUZZ]  = "Buzzer",
#endif
};

#ifdef CONFIG_BASE_USE_BTN
static button_handle_t btn[2];

static void cb_button(void *arg, void *data) {
    static const char *BTAG = "Button";
    int pin = (int)data;
    switch (iot_button_get_event(arg)) {
    case BUTTON_PRESS_DOWN:
        ESP_LOGI(BTAG, "%d press", pin);
        if (pin == PIN_BTN) hid_report_dial(HID_TARGET_ALL, DIAL_DN);
        break;
    case BUTTON_PRESS_UP:
        ESP_LOGI(BTAG, "%d release[%d]", pin, iot_button_get_ticks_time(arg));
        if (pin == PIN_BTN) hid_report_dial(HID_TARGET_ALL, DIAL_UP);
        break;
    case BUTTON_SINGLE_CLICK:
        ESP_LOGI(BTAG, "%d single click", pin);
        break;
    case BUTTON_DOUBLE_CLICK:
        ESP_LOGI(BTAG, "%d double click", pin);
        break;
    case BUTTON_MULTIPLE_CLICK:
        ESP_LOGI(BTAG, "%d click %d times", pin, iot_button_get_repeat(arg));
        break;
    case BUTTON_LONG_PRESS_HOLD:
        ESP_LOGI(BTAG, "%d long press %d",
                 pin, iot_button_get_long_press_hold_cnt(arg));
        break;
    default: break;
    }
}

#   ifdef CONFIG_BASE_ADC_JOYSTICK
static button_handle_t jstk[4];

static void cb_joystick(void *arg, void *data) {
    button_event_t event = iot_button_get_event(arg);
    if (event != BUTTON_PRESS_DOWN && event != BUTTON_LONG_PRESS_HOLD) return;
    int x = adc_read(0), y = adc_read(1);
    if (x == -1 || y == -1) return;
    x = x > 1900 ? (x - 1900) : x < 1400 ? (1400 - x) : 0;
    y = y > 1900 ? (y - 1900) : y < 1400 ? (1400 - y) : 0;
    hid_report_mouse_move(HID_TARGET_ALL, x / 28, y / 28); // -50 ~ +50
}
#   endif

static button_handle_t button_init(
    button_config_t *conf, gpio_num_t pin, button_cb_t cb
) {
    button_handle_t hdl = iot_button_create(conf);
    if (!hdl) {
        ESP_LOGE(TAG, "bind to GPIO%d failed", pin);
    } else LOOPN(event, BUTTON_EVENT_MAX) {
        if (event == BUTTON_MULTIPLE_CLICK) {
            button_event_config_t evt = {
                .event = event,
                .event_data.multiple_clicks.clicks = 3,
            };
            iot_button_register_event_cb(hdl, evt, cb, (void *)pin);
        } else {
            iot_button_register_cb(hdl, event, cb, (void *)pin);
        }
    }
    return hdl;
}
#endif // CONFIG_BASE_USE_BTN

