hankso/esp32/espbase/main/drivers.c
#ifdef CONFIG_BASE_USE_KNOB
static knob_handle_t knob;
static const char *KTAG = "Knob";

static void cb_knob(void *arg, void *data) {
    switch (iot_knob_get_event(arg)) {
    case KNOB_LEFT:
        ESP_LOGD(KTAG, "left rotate %d", iot_knob_get_count_value(arg));
        hid_report_dial(HID_TARGET_ALL, DIAL_L);
        break;
    case KNOB_RIGHT:
        ESP_LOGD(KTAG, "right rotate %d", iot_knob_get_count_value(arg));
        hid_report_dial(HID_TARGET_ALL, DIAL_R);
        break;
    default: break;
    }
}
#endif

static void IRAM_ATTR UNUSED gpio_isr_endstop(void *arg) {
#ifdef CONFIG_BASE_USE_INT
    ets_printf("PIN_INT %s\n", gpio_get_level(PIN_INT) ? "RISE" : "FALL");
#endif
#ifdef CONFIG_BASE_GPIOEXP_I2C
    LOOPN(i, LEN(i2c_pin_data)) {
        if (i2c_gexp_get_level(PIN_I2C_BASE + i * 8, NULL, true)) continue;
        ets_printf("I2C GPIOExp: %s\n", format_binary(i2c_pin_data[i], 1));
    }
#endif
#ifdef CONFIG_BASE_GPIOEXP_SPI
    if (spi_gexp_get_level(PIN_SPI_BASE, NULL, true)) return;
    LOOPN(i, PIN_SPI_COUNT / 8) {
        ets_printf("SPI GPIOExp: %s\n", format_binary(spi_pin_data[i], 1));
    }
#endif
}

static void gpio_initialize() {
#ifdef CONFIG_BASE_USE_INT
    const gpio_config_t int_conf = {
        .pin_bit_mask = BIT64(PIN_INT),
        .mode         = GPIO_MODE_INPUT,
#   if defined(CONFIG_BASE_INT_POSEDGE) || defined(CONFIG_BASE_INT_HIGH)
        .pull_up_en   = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_ENABLE,
#   else
        .pull_up_en   = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
#   endif
#   if defined(CONFIG_BASE_INT_NEGEDGE)
        .intr_type    = GPIO_INTR_NEGEDGE,
#   elif defined(CONFIG_BASE_INT_POSEDGE)
        .intr_type    = GPIO_INTR_POSEDGE,
#   elif defined(CONFIG_BASE_INT_ANYEDGE)
        .intr_type    = GPIO_INTR_ANYEDGE,
#   elif defined(CONFIG_BASE_INT_LOW)
        .intr_type    = GPIO_INTR_LOW_LEVEL,
#   elif defined(CONFIG_BASE_INT_HIGH)
        .intr_type    = GPIO_INTR_HIGH_LEVEL,
#   endif
    };
    ESP_ERROR_CHECK( gpio_config(&int_conf) );
    ESP_ERROR_CHECK( gpio_install_isr_service(0) );
    ESP_ERROR_CHECK( gpio_isr_handler_add(PIN_INT, gpio_isr_endstop, NULL) );
#endif
#ifdef CONFIG_BASE_USE_KNOB
    const knob_event_t events[] = { KNOB_LEFT, KNOB_RIGHT };
    const knob_config_t knob_conf = {
        .default_direction = 0,     // 0:positive; 1:negative
        .gpio_encoder_a = PIN_ENCA,
        .gpio_encoder_b = PIN_ENCB
    };
    if (!( knob = iot_knob_create(&knob_conf) )) {
        ESP_LOGE(KTAG, "bind to GPIO%d & %d failed", PIN_ENCA, PIN_ENCB);
    } else LOOPN(i, LEN(events)) {
        iot_knob_register_cb(knob, events[i], cb_knob, NULL);
    }
#endif
#ifdef CONFIG_BASE_USE_BTN
    button_config_t btn_conf = {
        .type = BUTTON_TYPE_GPIO,
        .gpio_button_config = {
            .gpio_num = PIN_BTN,
            .active_level = strbool(Config.sys.BTN_HIGH),
        }
    };
    btn[0] = button_init(&btn_conf, PIN_BTN, cb_button);
    if (startswith(gpio_default_usage[GPIO_NUM_0] ?: "", "Strapping")) {
        btn_conf.gpio_button_config.gpio_num = GPIO_NUM_0;
        btn_conf.gpio_button_config.active_level = 0;
        btn[1] = button_init(&btn_conf, GPIO_NUM_0, cb_button);
    }
#   ifdef CONFIG_BASE_ADC_JOYSTICK
    btn_conf.type = BUTTON_TYPE_ADC;
    btn_conf.long_press_time = CONFIG_BUTTON_SHORT_PRESS_TIME_MS + 20;
#       ifdef TARGET_IDF_5
    btn_conf.adc_button_config.adc_handle = adc.oneshot;
#       endif
    LOOPN(i, LEN(adc.chans)) {
        if (adc.chans[i] == ADC_CHANNEL_MAX) continue;
        btn_conf.adc_button_config.adc_channel = adc.chans[i];
        btn_conf.adc_button_config.button_index = 0;
        btn_conf.adc_button_config.min = 0;
        btn_conf.adc_button_config.max = 1400; // 0.0-1.4V
        jstk[2 * i + 0] = button_init(&btn_conf, adc.pins[i], cb_joystick);
        btn_conf.adc_button_config.button_index = 1;
        btn_conf.adc_button_config.min = 1900;
        btn_conf.adc_button_config.max = 3300; // 1.9-3.3V
        jstk[2 * i + 1] = button_init(&btn_conf, adc.pins[i], cb_joystick);
    }
#   endif
#endif
}

esp_err_t gexp_set_level(int pin, bool level) {
    if (GPIO_IS_VALID_GPIO(pin)) return gpio_set_level(pin, level);
#ifdef CONFIG_BASE_GPIOEXP_I2C
    if (PIN_IS_I2CEXP(pin))      return i2c_gexp_set_level(pin, level);
#endif
#ifdef CONFIG_BASE_GPIOEXP_SPI
    if (PIN_IS_SPIEXP(pin))      return spi_gexp_set_level(pin, level);
#endif
    return ESP_ERR_INVALID_ARG;
}

esp_err_t gexp_get_level(int pin, bool *level, bool sync) {
    if (GPIO_IS_VALID_GPIO(pin)) {
        *level = gpio_get_level(pin);
        return ESP_OK;
    }
#ifdef CONFIG_BASE_GPIOEXP_I2C
    if (PIN_IS_I2CEXP(pin)) return i2c_gexp_get_level(pin, level, sync);
#endif
#ifdef CONFIG_BASE_GPIOEXP_SPI
    if (PIN_IS_SPIEXP(pin)) return spi_gexp_get_level(pin, level, sync);
#endif
    return ESP_ERR_INVALID_ARG;
}

void gpio_table(bool i2c, bool spi) {
    const char *value;
    printf("Native GPIO %d-%d\nPIN Value Usage\n", 0, GPIO_PIN_COUNT - 1);
    LOOPN(pin, GPIO_PIN_COUNT) {
        if (!GPIO_IS_VALID_GPIO(pin)) continue;
        value = gpio_get_level(pin) ? "HIGH" : "LOW";
        printf("%-3d %5s %s\n", pin, value, gpio_default_usage[pin] ?: "");
    }
#ifdef CONFIG_BASE_GPIOEXP_I2C
    if (i2c) {
        printf("\nI2C GPIOExp %d-%d\nPIN Value\n",
               PIN_I2C_BASE, PIN_I2C_MAX - 1);
        bool level;
        esp_err_t err;
        LOOP(pin, PIN_I2C_BASE, PIN_I2C_MAX) {
            if (!( err = i2c_gexp_get_level(pin, &level, false) )) {
                value = level ? "HIGH" : "LOW";
            } else if (err == ESP_ERR_NOT_FOUND) {
                value = "";
            } else {
                value = esp_err_to_name(err);
            }
            printf("%-3d %5s\n", pin, value);
        }
    }
#endif
#ifdef CONFIG_BASE_GPIOEXP_SPI
    if (spi) {
        printf("\nSPI GPIOExp %d-%d\nPIN Value\n",
               PIN_SPI_BASE, PIN_SPI_MAX - 1);
        bool level;
        esp_err_t err;
        LOOP(pin, PIN_SPI_BASE, PIN_SPI_MAX) {
            if (!( err = spi_gexp_get_level(pin, &level, false) )) {
                value = level ? "HIGH" : "LOW";
            } else if (err == ESP_ERR_INVALID_STATE) {
                value = "";
            } else {
                value = esp_err_to_name(err);
            }
            printf("%-3d %5s\n", pin, value);
        }
    }
#endif
}

