hankso/esp32/espbase/main/drivers.c
/******************************************************************************
 * UART with custom pin
 */

static void uart_initialize() {
    // esp_vfs_dev_uart_register is called on startup code to use /dev/uart0
    fflush(stdout); fsync(fileno(stdout));

#ifdef CONFIG_BASE_USE_UART
    // UART driver configuration
    const uart_config_t uart_conf = {
        .baud_rate = 115200,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
#   if SOC_UART_SUPPORT_REF_TICK
        .source_clk = UART_SCLK_REF_TICK
#   elif SOC_UART_SUPPORT_XTAL_CLK
        .source_clk = UART_SCLK_XTAL
#   else
#       error "No UART clock source is aware of DFS"
#   endif
    };
    uart_param_config(NUM_UART, &uart_conf);
    uart_set_pin(NUM_UART, PIN_TXD, PIN_RXD, PIN_RTS, PIN_CTS);
    ESP_ERROR_CHECK( uart_driver_install(NUM_UART, 256, 0, 0, NULL, 0) );
#endif
}

/******************************************************************************
 * Task Watchdog
 */

static void twdt_initialize() {
#if defined(CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0) \
 || defined(CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1)
    // Idle tasks are created on each core automatically by RTOS scheduler
    // with the lowest possible priority (0). Our tasks have higher priority,
    // thus leaving almost no time for idle tasks to run. Disable WDT on them.
#   ifdef CONFIG_FREERTOS_UNICORE
    LOOPN(i, 1)
#   else
    LOOPN(i, 2)
#   endif
    {
        TaskHandle_t idle = xTaskGetIdleTaskHandleForCPU(i);
        if (idle && !esp_task_wdt_status(idle) && !esp_task_wdt_delete(idle)) {
            ESP_LOGI(TAG, "Task IDLE%d @ CPU%d removed from WDT", i, i);
        }
    }
#endif // CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPUx
}

esp_err_t twdt_feed() {
#ifdef CONFIG_TASK_WDT
    return esp_task_wdt_reset();
#else
    return ESP_OK;
#endif
}

void driver_initialize() {
    const char * tags[] = {
        "gpio", "adc button", "led_indicator", "Knob", "Button",
    };
    LOOPN(i, LEN(tags)) { esp_log_level_set(tags[i], ESP_LOG_WARN); }

    pwm_initialize();
#ifdef CONFIG_BASE_USE_ADC
    adc_initialize();
#endif
#ifdef CONFIG_BASE_USE_DAC
    dac_initialize();
#endif
#ifdef CONFIG_BASE_USE_LED
    led_initialize();
#endif
#ifdef CONFIG_BASE_USE_SPI
    spi_initialize();
#endif
#ifdef CONFIG_BASE_USE_I2C
    i2c_initialize();
#endif
#ifdef CONFIG_BASE_USE_GPIOEXP
    gexp_initialize();
#endif
    gpio_initialize();
    uart_initialize();
    twdt_initialize();
}
